{
    "header": {
        "home": "Home",
        "projects": "Projetos",
        "about": "Sobre",
        "contact": "Contato",
        "en": "Inglês",
        "pt-BR": "Português",
        "es": "Espanhol",
        "de": "Alemão",
        "fr": "Francês"
    },
    "home": {
        "prefix": "Olá! Eu sou",
        "title": "Murilo Wolfart",
        "description": "Sou um programador <span>front-end</span> com experiência em <span>ReactJS</span> e <span>NextJS</span>, que adora trabalhar em times <span>dinâmicos</span> e espaços <span>diversos</span>."
    },
    "projects": {
        "title": "Veja alguns projetos meus",
        "technologiesUsed": "Tecnologias utilizadas",
        "emafy": "Emafy",
        "emafyDescription": "Um wrapper de Spotify personalizado em que o usuário pode ouvir músicas e pesquisar mídias.",
        "emafyP1": "Este é um wrapper personalizado para o Spotify, que pode ser utilizado para tocar músicas, artistas, álbuns e playlists. Ele usa um design moderno, disponível no Figma.", 
        "emafyP2": "O projeto foi criado utilizando primariamente React e Styled Components, e o objetivo principal foi aprender estas frameworks, melhorar minhas habilidades com elas, e estudar conceitos de Front-end. Além disso, foi usado também para praticar o uso de bibliotecas React, como Infinite Scroll, Jest, e Font-awesome. Neste projeto foi também realizado uma migração de um setup em CRA para um em Parcel.",
        "emafyP3": "Este projeto foi inicialmente criado com a ajuda de Afonso Ferrer, um colega meu, e posteriormente mantido por mim.",
        "portfolio": "Portfolio",
        "portfolioDescription": "A página que você está atualmente vendo, que contém informações sobre mim e meus projetos.",
        "portfolioP1": "Este portfolio foi construído utilizando um layout meu próprio. Mesmo que o website seja relativamente simples, ele foi desenvolvido utilizando NextJS, já que é uma framework prática e eu já estava acostumado com ela. O objetivo principal aqui é exibir meus projetos e fornecer mais informações sobre mim.",
        "patas": "Website interno do Patas Dadas",
        "patasDescription": "Website legado para a ONG local Patas Dadas, construído para gerenciar dados internos.",
        "patasP1": "Este projeto foi inicialmente feito como um trabalho acadêmico. Ele viria ser um sistema interno para a ONG local Patas Dadas, a fim de que se possa organizar dados internos como animais disponíveis para adoção, recursos, alimentos, etc.",
        "patasP2": "O projeto foi construído junto a duas colegas minhas, e o front-end utiliza jQuery, HTML puro e Bootstrap, enquanto o back-end utiliza um servidor Java e um banco de dados em PostgreSQL.",
        "patasP3": "No final das contas o projeto foi deprecado, tornando-se legado.",
        "cow": "The Homogeneous Cow Maze",
        "cowDescription": "Jogo 3D desenvolvido em C++ com OpenGL, inspirado pelo clássico jogo DOS Chip's Challenge.",
        "cowP1": "Este é um jogo 3D desenvolvido utilizando C++ e a biblioteca OpenGL. Ele é a parte final de um conjunto de projetos acadêmicos utilizados para estudar conceitos de computação gráfica.",
        "cowP2": "O jogo é fortemente inspirado no clássico de 1989 Chip's Challenge, utilizando a mesma lógica em um espaço 3D. O jogador deve coletar vaquinhas espalhadas em cada nível e levá-las ao pai, a fim de avançar para o próximo nível. Um dos requisitos do trabalho era utilizar um modelo 3D de vaca, por isso a temática do jogo.",
        "cowP3": "Ele contém 5 níveis com temas e músicas diferentes. Algumas outras tecnologias e bibliotecas foram utilizadas para montar ele. Mais detalhes podem ser encontrados no repositório do projeto.",
        "dave": "Réplica de Dangerous Dave",
        "daveDescription": "Uma réplica do jogo de 1988, Dangerous Dave, desenvolvido em Python OO e funcional.",
        "daveP1": "Este projeto é uma réplica do jogo de 1988, Dangerous Dave, que fora desenvolvido pela Id Software. Esta réplica é quase idêntica a original, com exceção de que ela não possui inimigos.",
        "daveP2": "O projeto foi desenvolvido como um trabalho acadêmico, onde o objetivo era estudar diferentes paradigmas de programação em uma mesma linguagem: paradigma estruturado, OO e funcional. De uma lista de várias linguagens, o grupo escolheu Python.",
        "daveP3": "Uma parte do projeto roda em OO enquanto outra parte roda em paradigma funcional. Mais detalhes sobre o projeto podem ser encontrados no seu repositório.",
        "viewRepo": "Você pode visualizar o repositório do projeto <a>aqui</a>.",
        "close": "Fechar",
        "tech": {
            "cpp": "C++",
            "python": "Python",
            "javascript": "Javascript",
            "java": "Java",
            "react": "ReactJS",
            "opengl": "OpenGL",
            "unity": "Unity",
            "tailwind": "TailwindCSS",
            "cssmodules": "CSS Modules",
            "jest": "Jest",
            "bootstrap": "Bootstrap",
            "jquery": "JQuery",
            "sass": "Sass",
            "styled": "Styled Components",
            "postgres": "PostgreSQL",
            "next": "NextJS",
            "cra": "Create React App",
            "parcel": "Parcel",
            "ts": "Typescript",
            "prettier": "Prettier"
        }
    },
    "about": {
        "title": "Sobre mim",
        "paragraphOne": "Sou um cientista da computação e desenvolvedor de software morando em Porto Alegre, RS, Brasil. Trabalho com desenvolvimento desde 2016, mas tenho contato com linguagens de programação desde criança!",
        "paragraphTwo": "Apesar de eu ter experiência com diversas linguagens e ferramentas, estou atualmente trabalhando mais com front-end. Possuo mais de 5 anos de experiência com programação front-end, mais de três anos de experiência com ReactJS e um pouco mais de um ano de experiência com NextJS. Além dessas frameworks, também trabalhei com Angular, TailwindCSS, MaterialUI, Styled Components, testes unitários, dentre outras ferramentas.",
        "paragraphThree": "Além de programar, eu gosto de praticar esportes, ouvir música e jogar video-games - principalmente metroidvanias e side-scrollers (sim, sou um grande fã de Nintendo). Nos finais de semana eu gosto muito de andar de roller enquanto ouço uma boa música dos anos 80. Também gosto de fazer trilhas e curtir a natureza."
    },
    "contact": {
        "title": "Contato",
        "description": "Abaixo seguem alguns links para algumas redes minhas na internet. Sinta-se à vontade para falar comigo através de qualquer um deles!",
        "linkedin": "LinkedIn",
        "github": "Github",
        "email": "E-mail",
        "back-to-top": "Voltar ao topo"
    }
}