{
    "projects": {
        "emafy": "Emafy",
        "emafyShort": "A custom spotify wrapper",
        "emafyLong": "<p>This is a custom wrapper for Spotify, which can be used to visualize and play songs, artists, albums and playlists.</p><p>The project was created using primarily React and Styled Components, and the main goal was to learn these frameworks, improve my skills with them, and study front-end concepts. Furthermore, it was used to experiment with multiple React libraries, such as infinite scroll, jest, and font awesome. It was also used to perform a migration from CRA setup to Parcel.</p><p>This project was first created with the help of Afonso Ferrer, a coworker of mine, and later on maintained by me. The website is deployed at <a href=\"https://mwolfart.github.io/emafy\" target=\"_blank\" rel=\"noreferrer\">Github Pages</a>.</p>",
        "expensable": "Expensable",
        "expensableShort": "An online expense management tool",
        "expensableLong": "<p>This is an online tool created to manage expenses and savings. The user can log all of their daily expenses, assign them to custom categories and view a monthly or periodic dashboard in order to keep track of financial goals.</p><p>The project was designed using Remix, Prisma, MongoDB and TailwindCSS. The main goals here were to A) replace a set of spreadsheets I was using to keep track of my expenses and B) learn Remix and acquire a little bit of experience with MongoDB.</p><p>Further instructions on how to use the application can be found in the project ReadMe on its repository in Github.</p><p>An initial version of the app is available at <a href=\"https://expensable.vercel.app/\" target=\"_blank\" rel=\"noreferrer\">Vercel</a></p>",
        "portfolio": "Portfolio",
        "portfolioShort": "The web page you're currently viewing",
        "portfolioLong": "<p>So far I had three versions of my portfolio, with this being the third one. It was developed using AstroJS and Tailwind, following a view transitions tutorial by Jack Herrington (available on <a href=\"https://www.youtube.com/watch?v=lISvyIaSRyk\" rel=\"noreferrer\" target=\"blank\">Youtube</a>).</p><p>The first version was a very bland one developed with pure React, React Router and class components, while the second one was created with NextJS and Tailwind. All versions used a design developed by myself.</p><p>The main reason for developing a third version in favor of the second one is the effectiveness of AstroJS for this type of project (and to also try a few more transitions).</p>",
        "repoLink": "Link to the project's repository",
        "otherProjects": "Other projects"
    },
    "home": {
        "prefix": "Hey there, I'm",
        "name": "Murilo Wolfart",
        "suffix": "Full-stack developer"
    },
    "about": {
        "title": "About me",
        "one": "Software developer with <1>7+</1> years of vast experience, having worked with a variety of technologies ranging from <1>NextJS</1> and <1>React</1> to <1>Golang</1> and <1>MongoDB</1>.",
        "two": "I have worked in more than <1>10</1> different projects, ranging from small websites to large-scale applications, and have experience with <1>front-end</1>, <1>back-end</1>, <1>databases</1> and <1>DevOps</1>.",
        "three": "Beyond technical skills, I also have <1>strong communication skills</1> and aptness for engaging in <1>cross-functional teams</1>, working closely with designers, QAs and other developers, often making use of <1>agile</1> practices and frameworks.",
        "four": "I'm always on the look out for new things to learn and skills to improve, as well as being open for knowledge exchange and tech discussions in general.",
        "yearsOfExperience": "{years}+ years of experience",
        "years": "{years}+ years",
        "proficiencyExcellent": "Excellent skills",
        "proficiencyVeryGood": "Very good skills",
        "proficiencyGood": "Good skills",
        "proficiencyModerate": "Moderate skills",
        "proficiencyBasic": "Basic skills"
    }
}