{
    "projects": {
        "intro": "Veja alguns de meus ",
        "title": "Projetos",
        "emafy": {
            "title": "Emafy",
            "short": "Uma interface para o Spotify",
            "one": "Esta é uma interface personalizada para o Spotify, que pode ser usada para visualizar e tocar músicas, artistas, álbuns e playlists. Foi criada principalmente usando React e Styled Components.",
            "two": "O objetivo principal era aprender os frameworks utilizados, melhorar minhas habilidades com eles e estudar conceitos de front-end. Além disso, foi usada para experimentar várias bibliotecas do React, como infinite scroll, jest e font awesome.",
            "three": "Este projeto foi criado inicialmente com a ajuda de Afonso Ferrer, um colega de trabalho, e posteriormente mantido por mim.",
            "link": "O site está hospedado em <1>Github Pages</1>."
        },
        "expensable": {
            "title": "Expensable",
            "short": "Uma ferramenta online de gerenciamento de despesas",
            "one": "Esta é uma ferramenta online criada para gerenciar despesas e economias. O usuário pode registrar todas as suas despesas diárias, atribuí-las a categorias personalizadas e visualizar um painel mensal ou periódico para acompanhar suas metas financeiras.",
            "two": "O projeto foi desenvolvido usando Remix, Prisma, MongoDB e TailwindCSS. Os principais objetivos aqui eram A) substituir um conjunto de planilhas que eu usava para acompanhar minhas despesas e B) aprender e praticar com Remix e MongoDB.",
            "three": "Mais instruções sobre como usar a aplicação podem ser encontradas no ReadMe do projeto em seu repositório no Github.",
            "link": "Uma versão inicial do app está disponível em <1>Vercel</1>."
        },
        "cobalt": {
            "title": "CobaltUI",
            "short": "Uma biblioteca de UI personalizada",
            "one": "Este é um projeto em andamento, onde o objetivo é criar uma biblioteca de UI personalizada a ser usada em projetos futuros.",
            "two": "A biblioteca de componentes é construída usando React e CSS Modules, juntamente com Storybook para visualizar e testar os componentes. Mais detalhes estarão disponíveis em breve."
        },
        "repoLink": "Link para o repositório do projeto",
        "back": "Voltar para projetos"
    },
    "home": {
        "prefix": "Olá, eu sou",
        "name": "Murilo Wolfart",
        "suffix": "Desenvolvedor full-stack"
    },
    "about": {
        "title": "Sobre mim",
        "one": "Desenvolvedor de software com <1>7+</1> anos de vasta experiência, tendo trabalhado com uma variedade de tecnologias que vão de <1>NextJS</1> e <1>React</1> até <1>Golang</1> e <1>MongoDB</1>.",
        "two": "Trabalhei em mais de <1>10</1> projetos diferentes, que vão de pequenos sites a aplicações de grande escala, e tenho experiência com <1>front-end</1>, <1>back-end</1>, <1>bancos de dados</1> e <1>DevOps</1>.",
        "three": "Além das habilidades técnicas, também possuo <1>fortes habilidades de comunicação</1> e aptidão para participar de <1>equipes multifuncionais</1>, trabalhando em estreita colaboração com designers, QAs e outros desenvolvedores, frequentemente utilizando práticas e frameworks <1>ágeis</1>.",
        "four": "Estou sempre em busca de novas coisas para aprender e habilidades para melhorar, além de estar aberto a trocas de conhecimento e discussões técnicas em geral."
    },
    "techs": {
        "title": "Habilidades",
        "intro": "Abaixo estão algumas das tecnologias com as quais trabalhei",
        "yearsOfExperience": "{years}+ anos de experiência",
        "years": "{{years}}+ anos",
        "proficiencyExcellent": "Excelentes habilidades",
        "proficiencyVeryGood": "Boas habilidades",
        "proficiencyGood": "Boas habilidades",
        "proficiencyModerate": "Habilidades moderadas",
        "proficiencyBasic": "Habilidades básicas"
    },
    "contact": {
        "getInTouch": "Entre em contato comigo!",
        "email": "Envie-me um e-mail",
        "linkedin": "Perfil do LinkedIn",
        "github": "Perfil do Github"
    }
}